<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="pixel_values" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pixel_values">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_31450" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="0" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_31449" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="1536" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_31446" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="7680" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_31443" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="9216" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_31440" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="10752" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_31439" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="12288" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_31436" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="18432" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_31433" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="19968" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_31430" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="21504" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_31429" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="23040" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_31426" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="29184" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_31423" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="30720" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_31420" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="32256" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_31419" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="33792" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_31416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="39936" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_31413" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="41472" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_31410" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="43008" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_31409" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="44544" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_31406" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="50688" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_31403" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="52224" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_31400" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="53760" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_31399" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="55296" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_31396" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="61440" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_31393" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="62976" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_31390" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="64512" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_31389" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="66048" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_31386" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="72192" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_31383" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="73728" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_31380" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="75264" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_31379" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="76800" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_31376" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="82944" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_31373" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="84480" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_31370" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="86016" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_31369" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="87552" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_31366" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="93696" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_31363" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="95232" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_31360" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="96768" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_31359" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="98304" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_31356" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="104448" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_31353" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="105984" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_31350" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="107520" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_31349" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="109056" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_31346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="115200" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_31343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="116736" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_31340" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="118272" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_31339" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="119808" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_31336" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="125952" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_31333" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="127488" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="embeddings.cls_token" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="129024" size="1536" />
			<output>
				<port id="0" precision="FP32" names="embeddings.cls_token">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/embeddings/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/embeddings/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_25298" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130560" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_204" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="130560" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="/embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/embeddings/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/embeddings/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64" names="/embeddings/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/embeddings/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64" names="/embeddings/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/embeddings/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/embeddings/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_7198" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/embeddings/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embeddings/Reshape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/embeddings/Mul" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="130576" size="24" />
			<output>
				<port id="0" precision="I64" names="/embeddings/Mul_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/embeddings/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/embeddings/Equal_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/embeddings/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="130600" size="24" />
			<output>
				<port id="0" precision="I64" names="/embeddings/ConstantOfShape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/embeddings/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/embeddings/Where_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/embeddings/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/Expand_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="embeddings.patch_embeddings.projection.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 3, 16, 16" offset="130624" size="1179648" />
			<output>
				<port id="0" precision="FP32" names="embeddings.patch_embeddings.projection.weight">
					<dim>384</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/embeddings/patch_embeddings/projection/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_226" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="1310272" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/embeddings/patch_embeddings/projection/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/patch_embeddings/projection/Conv_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/embeddings/patch_embeddings/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/embeddings/patch_embeddings/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/embeddings/patch_embeddings/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130560" size="8" />
			<output>
				<port id="0" precision="I64" names="/embeddings/patch_embeddings/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/embeddings/patch_embeddings/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1311808" size="8" />
			<output>
				<port id="0" precision="I64" names="/embeddings/patch_embeddings/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Broadcast_260" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1311816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/embeddings/patch_embeddings/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/embeddings/patch_embeddings/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/embeddings/patch_embeddings/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64" names="/embeddings/patch_embeddings/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/embeddings/patch_embeddings/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embeddings/patch_embeddings/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/embeddings/patch_embeddings/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/patch_embeddings/Reshape_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_312" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1311824" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/embeddings/patch_embeddings/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/patch_embeddings/Transpose_output_0">
					<dim>1</dim>
					<dim>196</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/embeddings/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>196</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/Concat_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="embeddings.position_embeddings" type="Const" version="opset1">
			<data element_type="f32" shape="1, 197, 384" offset="1311848" size="302592" />
			<output>
				<port id="0" precision="FP32" names="embeddings.position_embeddings">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embeddings/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_440" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/encoder/layer.0/layernorm_before/Div" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/layernorm_before/Div_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_31331" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="1614440" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/encoder/layer.0/layernorm_before/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/layernorm_before/Mul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_31332" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="1615976" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/encoder/layer.0/layernorm_before/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/layernorm_before/Add_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_30686" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="1617512" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/encoder/layer.0/attention/attention/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/query/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/encoder/layer.0/attention/attention/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/query/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/encoder/layer.0/attention/attention/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207336" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/encoder/layer.0/attention/attention/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Reshape_2_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_650" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207368" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/encoder/layer.0/attention/attention/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Transpose_1_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/encoder/layer.0/attention/attention/Constant_14" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2207400" size="4" />
			<output>
				<port id="0" precision="FP32" names="/encoder/layer.0/attention/attention/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/encoder/layer.0/attention/attention/Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/layer.0/attention/attention/Shape_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/encoder/layer.0/attention/attention/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layer.0/attention/attention/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/encoder/layer.0/attention/attention/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2207404" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layer.0/attention/attention/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Broadcast_657" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1311816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/encoder/layer.0/attention/attention/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/encoder/layer.0/attention/attention/Slice_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/encoder/layer.0/attention/attention/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layer.0/attention/attention/Cast_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/encoder/layer.0/attention/attention/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layer.0/attention/attention/Sqrt_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/encoder/layer.0/attention/attention/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Cast_1_output_0,/encoder/layer.0/attention/attention/Div_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/encoder/layer.0/attention/attention/Sqrt_1" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layer.0/attention/attention/Sqrt_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/encoder/layer.0/attention/attention/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Mul_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_31334" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="2207412" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_30693" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="2208948" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/encoder/layer.0/attention/attention/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/key/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/encoder/layer.0/attention/attention/key/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/key/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/encoder/layer.0/attention/attention/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207336" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/encoder/layer.0/attention/attention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Reshape_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_680" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2798772" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/encoder/layer.0/attention/attention/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Transpose_2_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/encoder/layer.0/attention/attention/Sqrt_2" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layer.0/attention/attention/Sqrt_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/encoder/layer.0/attention/attention/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Mul_1_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/encoder/layer.0/attention/attention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>197</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/MatMul_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/encoder/layer.0/attention/attention/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layer.0/attention/attention/Softmax_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_31335" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="2798804" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_30700" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="2800340" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/encoder/layer.0/attention/attention/value/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/value/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/encoder/layer.0/attention/attention/value/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/value/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/encoder/layer.0/attention/attention/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207336" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/encoder/layer.0/attention/attention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Reshape_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_585" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207368" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/encoder/layer.0/attention/attention/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Transpose_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/encoder/layer.0/attention/attention/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/MatMul_1_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_689" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2207368" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/encoder/layer.0/attention/attention/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Transpose_3_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/encoder/layer.0/attention/attention/Concat_3" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3390164" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/encoder/layer.0/attention/attention/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/attention/Reshape_3_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_30707" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="3390188" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/encoder/layer.0/attention/output/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/output/dense/MatMul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/encoder/layer.0/attention/output/dense/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/attention/output/dense/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="/encoder/layer.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Constant_753" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="130568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="/encoder/layer.0/layernorm_after/Div" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layer.0/layernorm_after/Div_output_0">
					<dim>1</dim>
